main/src/Enums/ВидыРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВидыРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Планируемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фактический</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

main/src/CommonModules/УчетДенежныхСредствКлиент/Ext/Module.bsl
Процедура ОткрытьФормуСпискаПланируемыхРасходов() Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидРасхода", ПредопределенноеЗначение("Перечисление.ВидыРасходов.Планируемый"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтборПоДате", Истина);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("Документ.РасходДенежныхСредств.Форма.ФормаСписка", ПараметрыФормы,,"Планируемый");
	
КонецПроцедуры

Процедура ОткрытьФормуСпискаФактическихРасходов() Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидРасхода", ПредопределенноеЗначение("Перечисление.ВидыРасходов.Фактический"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтборПоДате", Истина);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("Документ.РасходДенежныхСредств.Форма.ФормаСписка", ПараметрыФормы,,"Фактический");
	
КонецПроцедуры
